In [301]:
import pandas as pd

In [302]:
dt = pd.read_excel("data_set.xlsx")
dt.head()

      NIM  Jenis_Kelamin   IPK  Tahun_Masuk  Tahun_Lulus  Masa_Studi
0  157002             22  3.51         2015         2019           1
1  157033             11  2.90         2015         2020           2
2  157050             11  3.65         2015         2019           1
3  167563             22  4.00         2016         2020           1
4  161029             22  2.75         2016         2021           2

In [303]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   NIM            10 non-null     int64
 1   Jenis_Kelamin  10 non-null     int64
 2   IPK            10 non-null     float64
 3   Tahun_Masuk    10 non-null     int64
 4   Tahun_Lulus    10 non-null     int64
 5   Masa_Studi     10 non-null     int64
dtypes: float64(1), int64(5)
memory usage: 544.0 bytes

In [304]:
x = dt.drop(['NIM'], axis=1)
# x = dt
x.head(15)

   Jenis_Kelamin   IPK  Tahun_Masuk  Tahun_Lulus  Masa_Studi
0             22  3.51         2015         2019           1
1             11  2.90         2015         2020           2
2             11  3.65         2015         2019           1
3             22  4.00         2016         2020           1
4             22  2.75         2016         2021           2
5             11  3.10         2016         2021           2
6             22  3.02         2016         2023           3
7             11  2.95         2015         2020           2
8             22  3.01         2016         2021           2
9             22  3.85         2015         2019           1

In [305]:
y = dt["Masa_Studi"].values
# y.head(15)
X_train, X_test, y_train, y_test = train_test_split(x, y,
test_size=0.2)

In [306]:
from sklearn.model_selection import train_test_split
# Import Gaussian Naive Bayes model
from sklearn.naive_bayes import GaussianNB
# Mengaktifkan/memanggil/membuat fungsi klasifikasi Naive bayes
modelnb = GaussianNB()
# Memasukkan data training pada fungsi klasifikasi naive bayes
classifier = modelnb.fit(x, y)
datauji = pd.read_excel("data_uji.xlsx")
datauji = datauji.drop(['NIM'], axis=1)
datauji.head(5)

   Jenis_Kelamin   IPK  Tahun_Masuk  Tahun_Lulus  Masa_Studi
0             22  3.00         2015         2021           2
1             11  3.29         2015         2022           2
2             11  3.58         2015         2019           1
3             22  2.00         2016         2023           3
4             11  2.16         2016         2021           2

In [307]:
x_test = datauji
x_test.head(5)

   Jenis_Kelamin   IPK  Tahun_Masuk  Tahun_Lulus  Masa_Studi
0             22  3.00         2015         2021           2
1             11  3.29         2015         2022           2
2             11  3.58         2015         2019           1
3             22  2.00         2016         2023           3
4             11  2.16         2016         2021           2

In [308]:
y_uji = datauji["Masa_Studi"]
y_uji.head(5)

0    2
1    2
2    1
3    3
4    2
Name: Masa_Studi, dtype: int64

In [309]:
Y_predict = classifier.predict(x_test)
print("Prediksi Naive Bayes : ",Y_predict)

Prediksi Naive Bayes :  [2 2 1 2 2 1]

In [310]:
from sklearn.metrics import accuracy_score
accuracy= accuracy_score(y_uji, Y_predict)
print("Akurasi Naive Bayes : ",accuracy)

Akurasi Naive Bayes :  0.8333333333333334

In [311]:
from sklearn.model_selection import cross_val_score
scores = cross_val_score(modelnb, x, y, cv=2)
scores.mean()

C:\Users\Muhammad Askar\AppData\Local\Programs\Python\Python38-32\lib\site-packages\sklearn\model_selection\_split.py:670: UserWarning: The least populated class in y has only 1 members, which is less than n_splits=2.
  warnings.warn(("The least populated class in y has only %d"

0.7